# Task 1
import asyncio
import random

async def fetch(i):
    await asyncio.sleep(random.random())
    print(f"Fetched {i}")

async def main():
    for i in range(5):
        await fetch(i)

asyncio.run(main())

# Task 2
# @time_it
def slow_operation():
    total = 0
    for i in range(10_000_000):
        total += i
    return total

result = slow_operation()
print("Result:", result)

# Task 3
# @cache
def slow_add(a, b):
    print("Computing...")
    return a + b

print(slow_add(2, 3))
print(slow_add(2, 3))
print(slow_add(4, 5))
print(slow_add(2, 3))


# Task 4
functions = []

for n in range(1, 6):
    functions.append(lambda: n * n)

for func in functions:
    print(func())

# Task5

# Умова:
# Дано список рядків (слів). Написати функцію, яка згрупує слова, що є анаграмами одне одного.
# Анаграми - це слова, які складаються з однакових літер у різній послідовності.
#
# Приклад:
#
# Вхід: ["eat", "tea", "tan", "ate", "nat", "bat"]
#
# Вихід: [["eat", "tea", "ate"], ["tan", "nat"], ["bat"]]


#----------------------------------------------------------------------------------------------------------
# Second sessions

# Task 1
# Написати функцію remove_all(lst, val), яка видаляє всі входження значення val зі списку lst.
# Умова: зміни мають відбуватися in-place (не можна створювати або повертати новий список,
# потрібно змінити існуючий об'єкт пам'яті).

# Task 2
# Дано довгий текстовий рядок. Написати функцію top_3_words(text),
# яка повертає список з трьох слів, що зустрічаються у тексті найчастіше,
# у порядку спадання їхньої частоти. Регістр не має значення, розділові знаки слід ігнорувати.

# Task 3
# Написати декоратор @retry(n), який змушує функцію повторити спробу виконання,
# якщо вона викликала виняток (Exception).
# Декоратор має зробити максимум n спроб. Якщо всі n спроб невдалі - прокинути виняток далі.

# Task 4
# Написати генератор chunker(iterable, size), який приймає список
# (або рядок) і повертає його частинами (чанками) заданого розміру size.

# Task 5
# Написати функцію is_palindrome(s), яка перевіряє, чи є рядок паліндромом
# (читається однаково в обидва боки). Пробіли та регістр ігноруємо.
# Умова: Завдання треба вирішити з просторовою складністю O(1).
# Тобто не можна використовувати зрізи на кшталт s[::-1], бо вони створюють копію рядка в пам'яті.