"""
Опис завдання
Уяви, що ти розробляєш просту систему моніторингу ІТ-інфраструктури.
Існують різні типи серверів — вебсервери, бази даних, файлові сервери.
Усі вони мають спільні параметри (назва, IP-адреса, статус), але водночас
кожен має свої специфічні метрики.

1. Створи базовий клас Server, який має:
Захищені атрибути: _name, _ip, _status.
Метод info(): повертає коротку інформацію про сервер.
Метод ping(): імітує перевірку зв'язку (наприклад, повертає рядок "Server <name> is online").
2. Реалізуй інкапсуляцію для _status:
Дозволені значення: "running" або "stopped".
Якщо встановлюється інше значення — вивести повідомлення про помилку.
3. Створи класи-спадкоємці:
WebServer(Server) — додає приватний атрибут __requests_per_minute.
DatabaseServer(Server) — додає приватний атрибут __active_connections.
FileServer(Server) — додає приватний атрибут __storage_usage.
4. У кожному класі-спадкоємці:
Перевизнач метод info(), щоб він відображав також і специфічні метрики конкретного типу сервера.
"""