# Потрібно розробити клас Product, який сам стежить за чистотою та правильністю своїх даних.
# Замість того, щоб писати купу перевірок у конструкторі.



# Рівень 1: Числовий контроль (Data Descriptor)
# Напиши дескриптор NonNegative. Він має гарантувати, що ціна або кількість товару не перетворяться на хаос.
# __set_name__: нехай дескриптор автоматично запам'ятовує ім'я атрибута.
# __set__: перевіряй тип (int або float). Якщо це не число - кидай TypeError. Якщо число менше за 0 - кидай ValueError.
# __get__: повертай значення зі словника об'єкта, а якщо звернення йде через клас - повертай сам об'єкт дескриптора.
#

#
# Рівень 2: Охайні рядки (String Descriptor)
# Напиши дескриптор CleanString для назви товару.
# При записі (__set__) він має:
# Перевірити, чи є значення рядком (str).
# Видалити зайві пробіли на початку та в кінці (.strip()).
# Зробити першу літеру великою, а решту — малими (.capitalize()).
#
#
# Рівень 3: Часова мітка (Non-data Descriptor)
# Додай дескриптор не-даних LastModified для атрибута last_updated.
# __get__: якщо в об'єкті ще немає збереженого часу, він має повернути поточний час (datetime.now()).
# Суть: оскільки це дескриптор не-даних (без __set__), як тільки ти вручну запишеш щось у product.last_updated,
# дескриптор перестане працювати для цього об'єкта, поступившись місцем записаному значенню.



class NonNegative:
    pass

class CleanString:
    pass

class Product:
    name = CleanString()
    price = NonNegative()
    quantity = NonNegative()

    def __init__(self, name, price, quantity):
        self.name = name
        self.price = price
        self.quantity = quantity


p = Product("  iphone 15 pro  ", 1000, 5)

print(f"'{p.name}'") # Має бути 'Iphone 15 pro' без пробілів
p.price = -10        # Має вилетіти ValueError
p.quantity = "багато" # Має вилетіти TypeError