# Завдання 1. Обробка текстової інформації (str)
# Задано початковий рядок:
# text = " python - це супер, python це круто! "
# Очисти рядок від зайвих пробільних символів на початку та в кінці.
# Проведи глобальну заміну підрядка "python" на "Python" (з капіталізацією першої літери).
# Обчисли фінальну кількість входжень слова "Python" у модифікованому тексті.
# Здійсни сегментацію (розбиття) отриманого рядка на окремі елементи за символом пробілу, зберігши результат у вигляді списку.

# text = " python - це супер, python це круто! "
# text = text.strip()
# text = text.replace("python", "Python")
# x = text.count("Python")
# text = text.split(" ")
# print(text, x)


# Завдання 2. Маніпуляції зі списками (list)
# Ініціалізуй список наступним вмістом: shopping_list = ["яблука", "молоко", "хліб"]
# Додай в кінець структури новий елемент "шоколад".
# Встав елемент "банани" на позицію з індексом 1, змістивши інші елементи праворуч.
# Виконай сортування поточного списку в алфавітному порядку.
# Видали елемент "молоко", звернувшись до нього за назвою, після чого вилучіть останній елемент списку, зафіксувавши його значення.

# shopping_list = ["яблука", "молоко", "хліб"]
# shopping_list.append("шоколап")
# shopping_list.insert(1, "banana")
# shopping_list.sort()
# shopping_list.remove("молоко")
# x = shopping_list.pop()
# print(x, shopping_list)

# Завдання 3. Робота з асоціативними масивами (dict)
# Створи словник, що відображає успішність студента: grades = {"Математика": 90, "Історія": 85}
# Надійно вилучи значення для ключа "Фізика". Програма не повинна викликати виняток KeyError,
# а має повернути 0 у разі відсутності дисципліни.
# Інтегруй нову пару - ключ "Програмування" та значення 100.
# Сформуй та виведи перелік усіх ключів (назв предметів), наявних у структурі словника на момент завершення операцій.

# grades = {"Математика": 90, "Історія": 85}
# x = grades.get("Фізика", "не атестований")
# grades.update({"Програмування" : 100})
# grades["Програмування 2"] = 101
# y = grades.keys()
# print(x)
# print(y)

# Завдання 4. Операції над множинами (set)
# Визначено два склади студентських гуртків:
# it_club = {"Олена", "Ігор", "Максим", "Анна"}
# English_club = {"Ігор", "Світлана", "Анна", "Дмитро"}
# Визнач перелік студентів, які одночасно відвідують обидва гуртки (операція перетину).
# Сформуй повний реєстр унікальних імен студентів, задіяних у позанавчальній діяльності (операція об'єднання).
# Виділи групу осіб, які навчаються виключно в IT-гуртку, виключивши тих, хто відвідує заняття з англійської мови (операція різниці).

# it_club = {"Олена", "Ігор", "Максим", "Анна"}
# English_club = {"Ігор", "Світлана", "Анна", "Дмитро"}
# lalashka = it_club.intersection(English_club)
# paaaa = it_club.union(English_club)
# yaaa = it_club.difference(English_club)
# print(lalashka, paaaa, yaaa)

# Завдання 5.
# Умова: У тебе є список із текстовими значеннями вартості товарів, де після числа йде значок долара ($).
# Тобі потрібно очистити ці дані: видалити значок валюти, привести кожне значення до числового типу float
# та конвертувати в гривні за курсом $1 = 41.5$ грн.
# Вхідні дані: prices_usd = ["10.5$", "25.0$", "4.99$", "100.0$"]
# Твоя задача: За допомогою функції map() та lambda-виразу трансформуй цей список у новий
# список prices_uah, який міститиме чисті числові значення в гривнях.

# prices_usd = ["10.5$", "25.0$", "4.99$", "100.0$"]
# course = 41.5
# prices_uah = list(map(lambda x: float(x.strip("$")) * course, prices_usd))
# print(prices_uah)

# Завдання 6
#
# Умова: У тебе є словник, де ключами є імена працівників, а значеннями - їхні заробітні плати в доларах.
# Керівництво прийняло рішення підняти зарплату на 10% усім, хто зараз отримує менше 2000 доларів.
# Вхідні дані: salaries = {"Олексій": 1800, "Марія": 2500, "Дмитро": 1600, "Ірина": 2200}
# Твоя задача: За допомогою словникового включення створи новий словник updated_salaries.
# Якщо поточна зарплата працівника менша за 2000, його нова зарплата має бути збільшена на 10% (помножена на 1.1).
# Якщо ж вона 2000 або більше - залиш її без змін.

# salaries = {"Олексій": 1800, "Марія": 2500, "Дмитро": 1600, "Ірина": 2200}
# new_salaries = {key: int(value * 1.1) if value < 2000 else value for key, value in salaries.items() }
# print(new_salaries)

